{"pageProps":{"work":{"id":1,"title":"Kohereza International (www.kohereza.com)","category":"Web Development","thumbnailUrl":"/images/works/portfolio-website.png","description":"\n    Kohereza International, founded in 2019 in Surat, Gujarat, is an import-export leader specializing in premium products like Construction Chemicals, Jewelry, Organic Grains, and Indian Handcrafted Items.\n\n    \n\nWe built their multilingual website using Next.js 14.2 with features like dynamic language support, static site generation, SEO, and responsive design, delivering a fast, user-friendly experience showcasing Kohereza's commitment to quality and global outreach.\n    ","publishedAt":"01 July 2022","images":["/images/works/work-01.png","/images/works/work-02.png","/images/works/work-03.png"],"previewUrl":"https://pofology.bdlancers.com/","techUsed":["Next.js 14.2: Leveraging its latest features such as app routing, static site generation, and image optimization for exceptional speed and SEO.","TypeScript: Ensuring type safety, maintainable code, and robust application development.","Material UI: For creating a modern, responsive, and visually appealing user interface.","i18n (Internationalization): Enabling multilingual support for 10 languages to serve a global audience.","EmailJS: Facilitating seamless and user-friendly form submissions for the 'Contact Us' page."],"featureList":["Multilingual Support: Dynamic content in 10 languages, auto-detected or user-selectable.","Static Site Generation (SSG): Ensures fast loading and high performance.","SEO Optimization: Improves search rankings and organic visibility.","Image Optimization: Faster load times with enhanced visual quality.","Responsive Design: Seamless experience across all devices.","App Routing: Simplified navigation with optimized routes.","Contact Us: Functional form powered by EmailJS.","Modern UI/UX: Clean design with Material UI for intuitive browsing.","Company Pages: Sections like 'About Us,' 'Contact us,' and 'Testimonials.'"]}},"__N_SSG":true}